app/Http/Livewire/ParentCrud.php

    public function mount($parentId = null)
    {
        $this->parentId = $parentId;

        $this->genders = Gender::select('id', 'gender')->get();
        $this->relationships = Relationship::select('id', 'relationship')->get();
---
select "id", "gender" from "gender"
select "id", "relationship" from "relationships"